Revit 2025 API
ExportSheetType Enumeration
 An enumerated type listing possible Sheet type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ExportSheetType
Public Enumeration ExportSheetType
public enum class ExportSheetType
type ExportSheetType
Members
Member name | Value | Description
Current | 0
Visible | 1
Select | 2
See Also
Reference
Autodesk.Revit.DB Namespace